Repository: stanercelik/PolySleep
Catalog: polynap/Resources/Localizations/Settings.xcstrings
Source language: en
Languages: de, ja, ms, th, tr

# alarmSettings.permission.alertMessage
source: To use alarm features, please grant notification permission from Settings.
de: Um die Alarmfunktionen zu nutzen, erteile bitte die Benachrichtigungsberechtigung in den Einstellungen.
ja: アラーム機能を使用するには、設定から通知の許可をお願いします。
ms: Untuk menggunakan ciri penggera, sila berikan kebenaran pemberitahuan dari Tetapan.
th: หากต้องการใช้ฟีเจอร์นาฬิกาปลุก โปรดให้สิทธิ์การแจ้งเตือนจากการตั้งค่า
tr: Alarm özelliğini kullanmak için Ayarlar'dan bildirim izni vermeniz gerekiyor.

# alarmSettings.permission.alertSettings
source: Go to Settings
de: Gehe zu den Einstellungen
ja: 設定に移動
ms: Pergi ke Tetapan
th: ไปที่การตั้งค่า
tr: Ayarlara Git

# alarmSettings.permission.alertTitle
source: Notification Permission
de: Benachrichtigungsberechtigung
ja: 通知の許可
ms: Kebenaran Pemberitahuan
th: สิทธิ์การแจ้งเตือน
tr: Bildirim İzni

# alarmSettings.permission.grantButton
source: Grant
de: Erteilen
ja: 許可する
ms: Berikan
th: ให้สิทธิ์
tr: İzin Ver

# alarmSettings.permission.granted
source: Permission granted
de: Berechtigung erteilt
ja: 許可されました
ms: Kebenaran diberikan
th: ให้สิทธิ์แล้ว
tr: İzin verildi

# alarmSettings.permission.notificationPermission
source: Notification Permission
de: Benachrichtigungsberechtigung
ja: 通知の許可
ms: Kebenaran Pemberitahuan
th: สิทธิ์การแจ้งเตือน
tr: Bildirim İzni

# alarmSettings.permission.required
source: Permission required
de: Berechtigung erforderlich
ja: 許可が必要
ms: Kebenaran diperlukan
th: ต้องใช้สิทธิ์
tr: İzin gerekli

# alarmSettings.permission.requiredMessage
source: Notification permission is required for alarms to work. Please grant permission from Settings.
de: Die Benachrichtigungsberechtigung ist erforderlich, damit Alarme funktionieren. Bitte erteile die Berechtigung in den Einstellungen.
ja: アラームが機能するには通知の許可が必要です。設定から許可してください。
ms: Kebenaran pemberitahuan diperlukan agar penggera berfungsi. Sila berikan kebenaran dari Tetapan.
th: ต้องใช้สิทธิ์การแจ้งเตือนเพื่อให้การปลุกทำงาน โปรดให้สิทธิ์จากการตั้งค่า
tr: Alarmların çalışması için bildirim izni gereklidir. Lütfen ayarlardan izin verin.

# alarmSettings.permission.requiredTitle
source: Permission Required
de: Berechtigung erforderlich
ja: 許可が必要
ms: Kebenaran Diperlukan
th: ต้องใช้สิทธิ์
tr: İzin Gerekli

# alarmSettings.permission.title
source: Notification Permission
de: Benachrichtigungsberechtigung
ja: 通知の許可
ms: Kebenaran Pemberitahuan
th: สิทธิ์การแจ้งเตือน
tr: Bildirim İzni

# alarmSettings.snooze.allowSnooze
source: Allow Snooze
de: Schlummern erlauben
ja: スヌーズを許可
ms: Benarkan Tunda
th: อนุญาตให้เลื่อนปลุก
tr: Erteleme İzin Ver

# alarmSettings.snooze.allowSnoozeDescription
source: Enable the ability to snooze alarms
de: Aktiviere die Möglichkeit, Alarme zu schlummern
ja: アラームをスヌーズする機能を有効にします
ms: Dayakan keupayaan untuk menunda penggera
th: เปิดใช้งานความสามารถในการเลื่อนปลุก
tr: Alarmı erteleyebilmeyi etkinleştir

# alarmSettings.snooze.duration
source: Snooze Duration
de: Schlummerdauer
ja: スヌーズ時間
ms: Tempoh Tunda
th: ระยะเวลาเลื่อนปลุก
tr: Erteleme Süresi

# alarmSettings.snooze.maxCount
source: Maximum Snoozes
de: Maximale Schlummeranzahl
ja: 最大スヌーズ回数
ms: Tunda Maksimum
th: จำนวนครั้งเลื่อนปลุกสูงสุด
tr: Maksimum Erteleme

# alarmSettings.snooze.minutesFormat
source: {duration} minutes
de: {duration} Minuten
ja: {duration}分
ms: {duration} minit
th: {duration} นาที
tr: {duration} dakika

# alarmSettings.snooze.timesFormat
source: {count} times
de: {count} Mal
ja: {count}回
ms: {count} kali
th: {count} ครั้ง
tr: {count} kez

# alarmSettings.snooze.title
source: Snooze Settings
de: Schlummereinstellungen
ja: スヌーズ設定
ms: Tetapan Tunda
th: การตั้งค่าการเลื่อนปลุก
tr: Erteleme Ayarları

# alarmSettings.sound.alarmSound
source: Alarm Sound
de: Alarmton
ja: アラーム音
ms: Bunyi Penggera
th: เสียงปลุก
tr: Alarm Sesi

# alarmSettings.sound.title
source: Sound Settings
de: Toneinstellungen
ja: サウンド設定
ms: Tetapan Bunyi
th: การตั้งค่าเสียง
tr: Ses Ayarları

# alarmSettings.sound.vibrationDescription
source: Use vibration when alarm sounds
de: Vibration verwenden, wenn der Alarm ertönt
ja: アラーム時にバイブレーションを使用します
ms: Gunakan getaran apabila penggera berbunyi
th: ใช้การสั่นเมื่อเสียงปลุกดัง
tr: Alarm çalarken titreşim kullan

# alarmSettings.sound.volume
source: Volume Level
de: Lautstärkepegel
ja: 音量レベル
ms: Tahap Kelantangan
th: ระดับเสียง
tr: Ses Seviyesi

# alarmSettings.sounds.critical
source: Critical Alarm
de: Kritischer Alarm
ja: 重大なアラーム
ms: Penggera Kritikal
th: การปลุกที่สำคัญ
tr: Kritik Alarm

# alarmSettings.sounds.default
source: Default Alarm
de: Standardalarm
ja: デフォルトのアラーム
ms: Penggera Lalai
th: การปลุกเริ่มต้น
tr: Varsayılan Alarm

# alarmSettings.sounds.system
source: System Default
de: Systemstandard
ja: システムのデフォルト
ms: Lalai Sistem
th: ค่าเริ่มต้นของระบบ
tr: Sistem Varsayılanı

# alarmSettings.status.active
source: Alarms active
de: Alarme aktiv
ja: アラーム有効
ms: Penggera aktif
th: การปลุกทำงานอยู่
tr: Alarmlar aktif

# alarmSettings.status.disabled
source: Alarms disabled
de: Alarme deaktiviert
ja: アラーム無効
ms: Penggera dilumpuhkan
th: การปลุกถูกปิดใช้งาน
tr: Alarmlar devre dışı

# alarmSettings.status.disabledMessage
source: Alarms will not sound when your sleep blocks end. Don't forget to use your own alarm app.
de: Alarme werden am Ende deiner Schlafblöcke nicht ertönen. Vergiss nicht, deine eigene Wecker-App zu verwenden.
ja: 睡眠ブロックが終了してもアラームは鳴りません。ご自身の別のアラームアプリを使用することをお忘れなく。
ms: Penggera tidak akan berbunyi apabila blok tidur anda tamat. Jangan lupa gunakan aplikasi penggera anda sendiri.
th: การปลุกจะไม่ดังเมื่อช่วงการนอนของคุณสิ้นสุด อย่าลืมใช้แอปนาฬิกาปลุกของคุณเอง
tr: Uyku bloklarınız bittiğinde alarm çalmayacak. Kendi alarm uygulamanızı kullanmayı unutmayın.

# alarmSettings.status.disabledTitle
source: Alarms Disabled
de: Alarme deaktiviert
ja: アラームが無効です
ms: Penggera Dilumpuhkan
th: การปลุกถูกปิดใช้งาน
tr: Alarmlar Devre Dışı

# alarmSettings.status.sleepAlarms
source: Sleep Alarms
de: Schlafalarme
ja: 睡眠アラーム
ms: Penggera Tidur
th: การปลุกการนอนหลับ
tr: Uyku Alarmları

# alarmSettings.subtitle
source: Configure alarm settings for when your sleep blocks end
de: Konfiguriere die Alarmeinstellungen für das Ende deiner Schlafblöcke
ja: 睡眠ブロック終了時のアラーム設定を行います
ms: Konfigurasikan tetapan penggera untuk apabila blok tidur anda tamat
th: กำหนดค่าการตั้งค่าการปลุกเมื่อช่วงการนอนของคุณสิ้นสุด
tr: Uyku bloklarınız bitiminde çalacak alarm ayarlarını yapılandırın

# alarmSettings.test.alertMessage
source: Test alarm will sound in 5 seconds.
de: Der Testalarm ertönt in 5 Sekunden.
ja: テストアラームが5秒後に鳴ります。
ms: Penggera ujian akan berbunyi dalam 5 saat.
th: การปลุกทดสอบจะดังใน 5 วินาที
tr: Test alarmı 5 saniye sonra çalacak.

# alarmSettings.test.notificationBody
source: This is a test alarm. You can test the Snooze and Dismiss buttons!
de: Dies ist ein Testalarm. Du kannst die Schlummer- und Ausschalten-Tasten testen!
ja: これはテストアラームです。スヌーズと停止ボタンをテストできます！
ms: Ini ialah penggera ujian. Anda boleh menguji butang Tunda dan Tolak!
th: นี่คือการปลุกทดสอบ คุณสามารถทดสอบปุ่มเลื่อนปลุกและปิดได้!
tr: Bu bir test alarmıdır. Ertele ve Kapat butonlarını test edebilirsiniz!

# alarmSettings.test.pendingAlarms
source: Pending Alarms
de: Ausstehende Alarme
ja: 保留中のアラーム
ms: Penggera Menunggu
th: การปลุกที่รอดำเนินการ
tr: Bekleyen Alarmlar

# alarmSettings.test.pendingAlarmsDescription
source: Number of alarms scheduled in the system
de: Anzahl der im System geplanten Alarme
ja: システムでスケジュールされているアラームの数
ms: Bilangan penggera yang dijadualkan dalam sistem
th: จำนวนการปลุกที่ตั้งเวลาไว้ในระบบ
tr: Sistemde planlanmış alarm sayısı

# alarmSettings.test.playTestAlarm
source: Play Test Alarm
de: Testalarm abspielen
ja: テストアラームを再生
ms: Mainkan Penggera Ujian
th: เล่นการปลุกทดสอบ
tr: Test Alarmı Çal

# alarmSettings.test.testDescription
source: Test your alarm sound and settings
de: Teste deinen Alarmton und deine Einstellungen
ja: アラーム音と設定をテストします
ms: Uji bunyi dan tetapan penggera anda
th: ทดสอบเสียงและการตั้งค่าการปลุกของคุณ
tr: Alarm sesini ve ayarlarını test edin

# alarmSettings.title
source: Alarm Settings
de: Alarmeinstellungen
ja: アラーム設定
ms: Tetapan Penggera
th: การตั้งค่านาฬิกาปลุก
tr: Alarm Ayarları

# general.cancel
source: Cancel
de: Abbrechen
ja: キャンセル
ms: Batal
th: ยกเลิก
tr: İptal

# notifications.management.subtitle
source: Configure when you want to be reminded before your sleep blocks
de: Konfiguriere, wann du vor deinen Schlafblöcken erinnert werden möchtest
ja: 睡眠ブロックの前にいつリマインドを受け取るかを設定します
ms: Konfigurasikan bila anda mahu diingatkan sebelum blok tidur anda
th: กำหนดค่าเวลาที่คุณต้องการให้เตือนก่อนช่วงการนอนของคุณ
tr: Uyku bloklarınızdan önce ne zaman hatırlatılmak istediğinizi ayarlayın

# notifications.management.title
source: Notification Management
de: Benachrichtigungsverwaltung
ja: 通知管理
ms: Pengurusan Pemberitahuan
th: การจัดการการแจ้งเตือน
tr: Bildirim Yönetimi

# notifications.minutes
source: minutes
de: Minuten
ja: 分
ms: minit
th: นาที
tr: dakika

# notifications.off
source: Off
de: Aus
ja: オフ
ms: Mati
th: ปิด
tr: Kapalı

# notifications.permission.title
source: Notification Permission
de: Benachrichtigungsberechtigung
ja: 通知の許可
ms: Kebenaran Pemberitahuan
th: สิทธิ์การแจ้งเตือน
tr: Bildirim İzni

# notifications.reminderTime.subtitle
source: How early should we remind you?
de: Wie früh sollen wir dich erinnern?
ja: どのくらい前にリマインドしますか？
ms: Berapa awal kami perlu mengingatkan anda?
th: เราควรเตือนคุณล่วงหน้านานแค่ไหน?
tr: Sizi ne kadar erken hatırlatalım?

# notifications.reminderTime.title
source: Reminder Time
de: Erinnerungszeit
ja: リマインダー時間
ms: Masa Peringatan
th: เวลาเตือน
tr: Hatırlatma Zamanı

# notifications.settings.title
source: Notification Settings
de: Benachrichtigungseinstellungen
ja: 通知設定
ms: Tetapan Pemberitahuan
th: การตั้งค่าการแจ้งเตือน
tr: Bildirim Ayarları

# notifications.status.activeProgram
source: Active Sleep Program
de: Aktives Schlafprogramm
ja: 有効な睡眠プログラム
ms: Program Tidur Aktif
th: โปรแกรมการนอนที่ใช้งานอยู่
tr: Aktif Uyku Programı

# notifications.status.noProgram
source: No active program
de: Kein aktives Programm
ja: 有効なプログラムがありません
ms: Tiada program aktif
th: ไม่มีโปรแกรมที่ใช้งานอยู่
tr: Aktif program yok

# notifications.status.reminderTime
source: Reminder Time
de: Erinnerungszeit
ja: リマインダー時間
ms: Masa Peringatan
th: เวลาเตือน
tr: Hatırlatma Süresi

# notifications.status.subtitle
source: Current notification status and settings
de: Aktueller Benachrichtigungsstatus und Einstellungen
ja: 現在の通知の状態と設定
ms: Status dan tetapan pemberitahuan semasa
th: สถานะและการตั้งค่าการแจ้งเตือนปัจจุบัน
tr: Mevcut bildirim durumu ve ayarları

# notifications.status.title
source: Notification Status
de: Benachrichtigungsstatus
ja: 通知の状態
ms: Status Pemberitahuan
th: สถานะการแจ้งเตือน
tr: Bildirim Durumu

# notifications.test.alert.message
source: Test notification has been sent successfully!
de: Testbenachrichtigung wurde erfolgreich gesendet!
ja: テスト通知が正常に送信されました！
ms: Pemberitahuan ujian telah berjaya dihantar!
th: ส่งการแจ้งเตือนทดสอบสำเร็จแล้ว!
tr: Test bildirimi başarıyla gönderildi!

# notifications.test.alert.title
source: Test Notification
de: Testbenachrichtigung
ja: テスト通知
ms: Pemberitahuan Ujian
th: การแจ้งเตือนทดสอบ
tr: Test Bildirimi

# notifications.test.delayed.subtitle
source: Test notification after 5 seconds
de: Testbenachrichtigung nach 5 Sekunden
ja: 5秒後にテスト通知
ms: Pemberitahuan ujian selepas 5 saat
th: ทดสอบการแจ้งเตือนใน 5 วินาที
tr: 5 saniye sonra test bildirimi

# notifications.test.delayed.title
source: 5-Second Test
de: 5-Sekunden-Test
ja: 5秒テスト
ms: Ujian 5 Saat
th: ทดสอบ 5 วินาที
tr: 5 Saniye Testi

# notifications.test.immediate.subtitle
source: Send a test notification right now
de: Sende jetzt eine Testbenachrichtigung
ja: 今すぐテスト通知を送信
ms: Hantar pemberitahuan ujian sekarang
th: ส่งการแจ้งเตือนทดสอบทันที
tr: Hemen test bildirimi gönder

# notifications.test.immediate.title
source: Instant Test
de: Sofortiger Test
ja: 即時テスト
ms: Ujian Segera
th: ทดสอบทันที
tr: Anında Test

# notifications.test.scheduled
source: Test notification scheduled successfully
de: Testbenachrichtigung erfolgreich geplant
ja: テスト通知が正常にスケジュールされました
ms: Pemberitahuan ujian berjaya dijadualkan
th: ตั้งเวลาการแจ้งเตือนทดสอบสำเร็จ
tr: Test bildirimi başarıyla planlandı

# notifications.test.subtitle
source: Test your notification settings
de: Teste deine Benachrichtigungseinstellungen
ja: 通知設定をテストします
ms: Uji tetapan pemberitahuan anda
th: ทดสอบการตั้งค่าการแจ้งเตือนของคุณ
tr: Bildirim ayarlarınızı test edin

# notifications.test.title
source: Test Notifications
de: Testbenachrichtigungen
ja: 通知のテスト
ms: Uji Pemberitahuan
th: ทดสอบการแจ้งเตือน
tr: Bildirim Testi

# notifications.twoHours
source: 2 hours
de: 2 Stunden
ja: 2時間
ms: 2 jam
th: 2 ชั่วโมง
tr: 2 saat

# alarmSettings.sound.vibration
source: Vibration
ja: バイブレーション
ms: Getaran
th: การสั่น
tr: Titreşim

# alarmSettings.status.title
source: Alarm Status
ja: アラームの状態
ms: Status Penggera
th: สถานะการปลุก
tr: Alarm Durumu

# alarmSettings.test.alertTitle
source: Test Alarm
ja: テストアラーム
ms: Uji Penggera
th: การปลุกทดสอบ
tr: Test Alarmı

# alarmSettings.test.notificationTitle
source: Test Alarm
ja: テストアラーム
ms: Uji Penggera
th: การปลุกทดสอบ
tr: Test Alarmı

# alarmSettings.test.title
source: Test & Info
ja: テストと情報
ms: Uji & Info
th: ทดสอบ & ข้อมูล
tr: Test ve Bilgi

# general.ok
source: OK
th: ตกลง
tr: Tamam
